In [ ]:
#SQLite Restricting and Sorting Data - Exercises, Practice, Solution

In [1]:
import sqlite3

In [9]:
db=sqlite3.connect("Employee.db")

In [10]:
cursor=db.cursor()

In [15]:
cursor.execute("create table Employee2(employee_id int primary key,first_name text,last_name text,email text,phone_number text,hire_date text,job_id text,salary int,commission_pct text,manager_id int,department_id int)")

In [16]:
db.commit()

In [18]:
with open('Saurav.txt','r')as file:
    row_count=0
    for row in file:
        cursor.execute("insert into Employee2 values(?,?,?,?,?,?,?,?,?,?,?)",row.split(","))
        db.commit()
        row_count+=1
print(row_count,"Record(s) Inserted")

107 Record(s) Inserted

In [19]:
result=cursor.execute("select * from Employee2")
for row in result:
    print(row)

(100, ' Steven   ', 'King      ', 'SKING   ', '515.123.4567', '6/17/1987', 'AD_PRES   ', 24000, '    ', 100, 90)
(101, ' Neena    ', 'Kochhar   ', 'NKOCHHAR', '515.123.4568', '6/18/1987', 'AD_VP     ', 17000, '    ', 100, 90)
(102, ' Lex      ', 'De Haan   ', 'LDEHAAN ', '515.123.4569', '6/19/1987', 'AD_VP     ', 17000, '    ', 100, 90)
(103, ' Alexander', 'Hunold    ', 'AHUNOLD ', '590.423.4567', '6/20/1987', 'IT_PROG   ', 9000, '    ', 102, 60)
(104, ' Bruce    ', 'Ernst     ', 'BERNST  ', '590.423.4568', '6/21/1987', 'IT_PROG   ', 6000, '    ', 103, 60)
(105, ' David    ', 'Austin    ', 'DAUSTIN ', '590.423.4569', '6/22/1987', 'IT_PROG   ', 4800, '    ', 103, 60)
(106, ' Valli    ', 'Pataballa ', 'VPATABAL', '590.423.4560', '6/23/1987', 'IT_PROG   ', 4800, '    ', 103, 60)
(107, ' Diana    ', 'Lorentz   ', 'DLORENTZ', '590.423.5567', '6/24/1987', 'IT_PROG   ', 4200, '    ', 103, 60)
(108, ' Nancy    ', 'Greenberg ', 'NGREENBE', '515.124.4569', '6/25/1987', 'FI_MGR    ', 12000, '    ', 101, 100)
(109, ' Daniel   ', 'Faviet    ', 'DFAVIET ', '515.124.4169', '6/26/1987', 'FI_ACCOUNT', 9000, '    ', 108, 100)
(110, ' John     ', 'Chen      ', 'JCHEN   ', '515.124.4269', '6/27/1987', 'FI_ACCOUNT', 8200, '    ', 108, 100)
(111, ' Ismael   ', 'Sciarra   ', 'ISCIARRA', '515.124.4369', '6/28/1987', 'FI_ACCOUNT', 7700, '    ', 108, 100)
(112, ' Jose Manu', 'Urman     ', 'JMURMAN ', '515.124.4469', '6/29/1987', 'FI_ACCOUNT', 7800, '    ', 108, 100)
(113, ' Luis     ', 'Popp      ', 'LPOPP   ', '515.124.4567', '6/30/1987', 'FI_ACCOUNT', 6900, '    ', 108, 100)
(114, ' Den      ', 'Raphaely  ', 'DRAPHEAL', '515.127.4561', '7/1/1987 ', 'PU_MAN    ', 11000, '    ', 100, 30)
(115, ' Alexander', 'Khoo      ', 'AKHOO   ', '515.127.4562', '7/2/1987 ', 'PU_CLERK  ', 3100, '    ', 114, 30)
(116, ' Shelli   ', 'Baida     ', 'SBAIDA  ', '515.127.4563', '7/3/1987 ', 'PU_CLERK  ', 2900, '    ', 114, 30)
(117, ' Sigal    ', 'Tobias    ', 'STOBIAS ', '515.127.4564', '7/4/1987 ', 'PU_CLERK  ', 2800, '    ', 114, 30)
(118, ' Guy      ', 'Himuro    ', 'GHIMURO ', '515.127.4565', '7/5/1987 ', 'PU_CLERK  ', 2600, '    ', 114, 30)
(119, ' Karen    ', 'Colmenares', 'KCOLMENA', '515.127.4566', '7/6/1987 ', 'PU_CLERK  ', 2500, '    ', 114, 30)
(120, ' Matthew  ', 'Weiss     ', 'MWEISS  ', '650.123.1234', '7/7/1987 ', 'ST_MAN    ', 8000, '    ', 100, 50)
(121, ' Adam     ', 'Fripp     ', 'AFRIPP  ', '650.123.2234', '7/8/1987 ', 'ST_MAN    ', 8200, '    ', 100, 50)
(122, ' Payam    ', 'Kaufling  ', 'PKAUFLIN', '650.123.3234', '7/9/1987 ', 'ST_MAN    ', 7900, '    ', 100, 50)
(123, ' Shanta   ', 'Vollman   ', 'SVOLLMAN', '650.123.4234', '7/10/1987', 'ST_MAN    ', 6500, '    ', 100, 50)
(124, ' Kevin    ', 'Mourgos   ', 'KMOURGOS', '650.123.5234', '7/11/1987', 'ST_MAN    ', 5800, '    ', 100, 50)
(125, ' Julia    ', 'Nayer     ', 'JNAYER  ', '650.124.1214', '7/12/1987', 'ST_CLERK  ', 3200, '    ', 120, 50)
(126, ' Irene    ', 'Mikkilinen', 'IMIKKILI', '650.124.1224', '7/13/1987', 'ST_CLERK  ', 2700, '    ', 120, 50)
(127, ' James    ', 'Landry    ', 'JLANDRY ', '650.124.1334', '7/14/1987', 'ST_CLERK  ', 2400, '    ', 120, 50)
(128, ' Steven   ', 'Markle    ', 'SMARKLE ', '650.124.1434', '7/15/1987', 'ST_CLERK  ', 2200, '    ', 120, 50)
(129, ' Laura    ', 'Bissot    ', 'LBISSOT ', '650.124.5234', '7/16/1987', 'ST_CLERK  ', 3300, '    ', 121, 50)
(130, ' Mozhe    ', 'Atkinson  ', 'MATKINSO', '650.124.6234', '7/17/1987', 'ST_CLERK  ', 2800, '    ', 121, 50)
(131, ' James    ', 'Marlow    ', 'JAMRLOW ', '650.124.7234', '7/18/1987', 'ST_CLERK  ', 2500, '    ', 121, 50)
(132, ' TJ       ', 'Olson     ', 'TJOLSON ', '650.124.8234', '7/19/1987', 'ST_CLERK  ', 2100, '    ', 121, 50)
(133, ' Jason    ', 'Mallin    ', 'JMALLIN ', '650.127.1934', '7/20/1987', 'ST_CLERK  ', 3300, '    ', 122, 50)
(134, ' Michael  ', 'Rogers    ', 'MROGERS ', '650.127.1834', '7/21/1987', 'ST_CLERK  ', 2900, '    ', 122, 50)
(135, ' Ki       ', 'Gee       ', 'KGEE    ', '650.127.1734', '7/22/1987', 'ST_CLERK  ', 2400, '    ', 122, 50)
(136, ' Hazel    ', 'Philtanker', 'HPHILTAN', '650.127.1634', '7/23/1987', 'ST_CLERK  ', 2200, '    ', 122, 50)
(137, ' Renske   ', 'Ladwig    ', 'RLADWIG ', '650.121.1234', '7/24/1987', 'ST_CLERK  ', 3600, '    ', 123, 50)
(138, ' Stephen  ', 'Stiles    ', 'SSTILES ', '650.121.2034', '7/25/1987', 'ST_CLERK  ', 3200, '    ', 123, 50)
(139, ' John     ', 'Seo       ', 'JSEO    ', '650.121.2019', '7/26/1987', 'ST_CLERK  ', 2700, '    ', 123, 50)
(140, ' Joshua   ', 'Patel     ', 'JPATEL  ', '650.121.1834', '7/27/1987', 'ST_CLERK  ', 2500, '    ', 123, 50)
(141, ' Trenna   ', 'Rajs      ', 'TRAJS   ', '650.121.8009', '7/28/1987', 'ST_CLERK  ', 3500, '    ', 124, 50)
(142, ' Curtis   ', 'Davies    ', 'CDAVIES ', '650.121.2994', '7/29/1987', 'ST_CLERK  ', 3100, '    ', 124, 50)
(143, ' Randall  ', 'Matos     ', 'RMATOS  ', '650.121.2874', '7/30/1987', 'ST_CLERK  ', 2600, '    ', 124, 50)
(144, ' Peter    ', 'Vargas    ', 'PVARGAS ', '650.121.2004', '7/31/1987', 'ST_CLERK  ', 2500, '    ', 124, 50)
(145, ' John     ', 'Russell   ', 'JRUSSEL ', '011.44.1344.', '8/1/1987 ', 'SA_MAN    ', 14000, '0.4 ', 100, 80)
(146, ' Karen    ', 'Partners  ', 'KPARTNER', '011.44.1344.', '8/2/1987 ', 'SA_MAN    ', 13500, '0.3 ', 100, 80)
(147, ' Alberto  ', 'Errazuriz ', 'AERRAZUR', '011.44.1344.', '8/3/1987 ', 'SA_MAN    ', 12000, '0.3 ', 100, 80)
(148, ' Gerald   ', 'Cambrault ', 'GCAMBRAU', '011.44.1344.', '8/4/1987 ', 'SA_MAN    ', 11000, '0.3 ', 100, 80)
(149, ' Eleni    ', 'Zlotkey   ', 'EZLOTKEY', '011.44.1344.', '8/5/1987 ', 'SA_MAN    ', 10500, '0.2 ', 100, 80)
(150, ' Peter    ', 'Tucker    ', 'PTUCKER ', '011.44.1344.', '8/6/1987 ', 'SA_REP    ', 10000, '0.3 ', 145, 80)
(151, ' David    ', 'Bernstein ', 'DBERNSTE', '011.44.1344.', '8/7/1987 ', 'SA_REP    ', 9500, '0.25', 145, 80)
(152, ' Peter    ', 'Hall      ', 'PHALL   ', '011.44.1344.', '8/8/1987 ', 'SA_REP    ', 9000, '0.25', 145, 80)
(153, ' Christoph', 'Olsen     ', 'COLSEN  ', '011.44.1344.', '8/9/1987 ', 'SA_REP    ', 8000, '0.2 ', 145, 80)
(154, ' Nanette  ', 'Cambrault ', 'NCAMBRAU', '011.44.1344.', '8/10/1987', 'SA_REP    ', 7500, '0.2 ', 145, 80)
(155, ' Oliver   ', 'Tuvault   ', 'OTUVAULT', '011.44.1344.', '8/11/1987', 'SA_REP    ', 7000, '0.15', 145, 80)
(156, ' Janette  ', 'King      ', 'JKING   ', '011.44.1345.', '8/12/1987', 'SA_REP    ', 10000, '0.35', 146, 80)
(157, ' Patrick  ', 'Sully     ', 'PSULLY  ', '011.44.1345.', '8/13/1987', 'SA_REP    ', 9500, '0.35', 146, 80)
(158, ' Allan    ', 'McEwen    ', 'AMCEWEN ', '011.44.1345.', '8/14/1987', 'SA_REP    ', 9000, '0.35', 146, 80)
(159, ' Lindsey  ', 'Smith     ', 'LSMITH  ', '011.44.1345.', '8/15/1987', 'SA_REP    ', 8000, '0.3 ', 146, 80)
(160, ' Louise   ', 'Doran     ', 'LDORAN  ', '011.44.1345.', '8/16/1987', 'SA_REP    ', 7500, '0.3 ', 146, 80)
(161, ' Sarath   ', 'Sewall    ', 'SSEWALL ', '011.44.1345.', '8/17/1987', 'SA_REP    ', 7000, '0.25', 146, 80)
(162, ' Clara    ', 'Vishney   ', 'CVISHNEY', '011.44.1346.', '8/18/1987', 'SA_REP    ', 10500, '0.25', 147, 80)
(163, ' Danielle ', 'Greene    ', 'DGREENE ', '011.44.1346.', '8/19/1987', 'SA_REP    ', 9500, '0.15', 147, 80)
(164, ' Mattea   ', 'Marvins   ', 'MMARVINS', '011.44.1346.', '8/20/1987', 'SA_REP    ', 7200, '0.1 ', 147, 80)
(165, ' David    ', 'Lee       ', 'DLEE    ', '011.44.1346.', '8/21/1987', 'SA_REP    ', 6800, '0.1 ', 147, 80)
(166, ' Sundar   ', 'Ande      ', 'SANDE   ', '011.44.1346.', '8/22/1987', 'SA_REP    ', 6400, '0.1 ', 147, 80)
(167, ' Amit     ', 'Banda     ', 'ABANDA  ', '011.44.1346.', '8/23/1987', 'SA_REP    ', 6200, '0.1 ', 147, 80)
(168, ' Lisa     ', 'Ozer      ', 'LOZER   ', '011.44.1343.', '8/24/1987', 'SA_REP    ', 11500, '0.25', 148, 80)
(169, ' Harrison ', 'Bloom     ', 'HBLOOM  ', '011.44.1343.', '8/25/1987', 'SA_REP    ', 10000, '0.2 ', 148, 80)
(170, ' Tayler   ', 'Fox       ', 'TFOX    ', '011.44.1343.', '8/26/1987', 'SA_REP    ', 9600, '0.2 ', 148, 80)
(171, ' William  ', 'Smith     ', 'WSMITH  ', '011.44.1343.', '8/27/1987', 'SA_REP    ', 7400, '0.15', 148, 80)
(172, ' Elizabeth', 'Bates     ', 'EBATES  ', '011.44.1343.', '8/28/1987', 'SA_REP    ', 7300, '0.15', 148, 80)
(173, ' Sundita  ', 'Kumar     ', 'SKUMAR  ', '011.44.1343.', '8/29/1987', 'SA_REP    ', 6100, '0.1 ', 148, 80)
(174, ' Ellen    ', 'Abel      ', 'EABEL   ', '011.44.1644.', '8/30/1987', 'SA_REP    ', 11000, '0.3 ', 149, 80)
(175, ' Alyssa   ', 'Hutton    ', 'AHUTTON ', '011.44.1644.', '8/31/1987', 'SA_REP    ', 8800, '0.25', 149, 80)
(176, ' Jonathon ', 'Taylor    ', 'JTAYLOR ', '011.44.1644.', '9/1/1987 ', 'SA_REP    ', 8600, '0.2 ', 149, 80)
(177, ' Jack     ', 'Livingston', 'JLIVINGS', '011.44.1644.', '9/2/1987 ', 'SA_REP    ', 8400, '0.2 ', 149, 80)
(178, ' Kimberely', 'Grant     ', 'KGRANT  ', '011.44.1644.', '9/3/1987 ', 'SA_REP    ', 7000, '0.15', 149, 80)
(179, ' harles   ', 'Johnson   ', 'CJOHNSON', '011.44.1644.', '9/4/1987 ', 'SA_REP    ', 6200, '0.1 ', 149, 80)
(180, ' Winston  ', 'Taylor    ', 'WTAYLOR ', '650.507.9876', '9/5/1987 ', 'SH_CLERK  ', 3200, '    ', 120, 50)
(181, ' Jean     ', 'Fleaur    ', 'JFLEAUR ', '650.507.9877', '9/6/1987 ', 'SH_CLERK  ', 3100, '    ', 120, 50)
(182, ' Martha   ', 'Sullivan  ', 'MSULLIVA', '650.507.9878', '9/7/1987 ', 'SH_CLERK  ', 2500, '    ', 120, 50)
(183, ' Girard   ', 'Geoni     ', 'GGEONI  ', '650.507.9879', '9/8/1987 ', 'SH_CLERK  ', 2800, '    ', 120, 50)
(184, ' Nandita  ', 'Sarchand  ', 'NSARCHAN', '650.509.1876', '9/9/1987 ', 'SH_CLERK  ', 4200, '    ', 121, 50)
(185, ' Alexis   ', 'Bull      ', 'ABULL   ', '650.509.2876', '9/10/1987', 'SH_CLERK  ', 4100, '    ', 121, 50)
(186, ' Julia    ', 'Dellinger ', 'JDELLING', '650.509.3876', '9/11/1987', 'SH_CLERK  ', 3400, '    ', 121, 50)
(187, ' Anthony  ', 'Cabrio    ', 'ACABRIO ', '650.509.4876', '9/12/1987', 'SH_CLERK  ', 3000, '    ', 121, 50)
(188, ' Kelly    ', 'Chung     ', 'KCHUNG  ', '650.505.1876', '9/13/1987', 'SH_CLERK  ', 3800, '    ', 122, 50)
(189, ' Jennifer ', 'Dilly     ', 'JDILLY  ', '650.505.2876', '9/14/1987', 'SH_CLERK  ', 3600, '    ', 122, 50)
(190, ' Timothy  ', 'Gates     ', 'TGATES  ', '650.505.3876', '9/15/1987', 'SH_CLERK  ', 2900, '    ', 122, 50)
(191, ' Randall  ', 'Perkins   ', 'RPERKINS', '650.505.4876', '9/16/1987', 'SH_CLERK  ', 2500, '    ', 122, 50)
(192, ' Sarah    ', 'Bell      ', 'SBELL   ', '650.501.1876', '9/17/1987', 'SH_CLERK  ', 4000, '    ', 123, 50)
(193, ' Britney  ', 'Everett   ', 'BEVERETT', '650.501.2876', '9/18/1987', 'SH_CLERK  ', 3900, '    ', 123, 50)
(194, ' Samuel   ', 'McCain    ', 'SMCCAIN ', '650.501.3876', '9/19/1987', 'SH_CLERK  ', 3200, '    ', 123, 50)
(195, ' Vance    ', 'Jones     ', 'VJONES  ', '650.501.4876', '9/20/1987', 'SH_CLERK  ', 2800, '    ', 123, 50)
(196, ' Alana    ', 'Walsh     ', 'AWALSH  ', '650.507.9811', '9/21/1987', 'SH_CLERK  ', 3100, '    ', 124, 50)
(197, ' Kevin    ', 'Feeney    ', 'KFEENEY ', '650.507.9822', '9/22/1987', 'SH_CLERK  ', 3000, '    ', 124, 50)
(198, ' Donald   ', 'OConnell  ', 'DOCONNEL', '650.507.9833', '9/23/1987', 'SH_CLERK  ', 2600, '    ', 124, 50)
(199, ' Douglas  ', 'Grant     ', 'DGRANT  ', '650.507.9844', '9/24/1987', 'SH_CLERK  ', 2600, '    ', 124, 50)
(200, ' Jennifer ', 'Whalen    ', 'JWHALEN ', '515.123.4444', '9/25/1987', 'AD_ASST   ', 4400, '    ', 101, 10)
(201, ' Michael  ', 'Hartstein ', 'MHARTSTE', '515.123.5555', '9/26/1987', 'MK_MAN    ', 13000, '    ', 100, 20)
(202, ' Pat      ', 'Fay       ', 'PFAY    ', '603.123.6666', '9/27/1987', 'MK_REP    ', 6000, '    ', 201, 20)
(203, ' Susan    ', 'Mavris    ', 'SMAVRIS ', '515.123.7777', '9/28/1987', 'HR_REP    ', 6500, '    ', 101, 40)
(204, ' Hermann  ', 'Baer      ', 'HBAER   ', '515.123.8888', '9/29/1987', 'PR_REP    ', 10000, '    ', 101, 70)
(205, ' Shelley  ', 'Higgins   ', 'SHIGGINS', '515.123.8080', '9/30/1987', 'AC_MGR    ', 12000, '    ', 101, 110)
(206, ' William  ', 'Gietz     ', 'WGIETZ  ', '515.123.8181', '10/1/1987', 'AC_ACCOUNT', 8300, '    ', 205, 110)

In [20]:
# 1. Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in the
# range $10,000 through $15,000.

In [23]:
sql="select first_name,last_name,salary from Employee2 where salary not between 10000 and 15000"
result=cursor.execute(sql)
for row in result:
    print(row)

(' Steven   ', 'King      ', 24000)
(' Neena    ', 'Kochhar   ', 17000)
(' Lex      ', 'De Haan   ', 17000)
(' Alexander', 'Hunold    ', 9000)
(' Bruce    ', 'Ernst     ', 6000)
(' David    ', 'Austin    ', 4800)
(' Valli    ', 'Pataballa ', 4800)
(' Diana    ', 'Lorentz   ', 4200)
(' Daniel   ', 'Faviet    ', 9000)
(' John     ', 'Chen      ', 8200)
(' Ismael   ', 'Sciarra   ', 7700)
(' Jose Manu', 'Urman     ', 7800)
(' Luis     ', 'Popp      ', 6900)
(' Alexander', 'Khoo      ', 3100)
(' Shelli   ', 'Baida     ', 2900)
(' Sigal    ', 'Tobias    ', 2800)
(' Guy      ', 'Himuro    ', 2600)
(' Karen    ', 'Colmenares', 2500)
(' Matthew  ', 'Weiss     ', 8000)
(' Adam     ', 'Fripp     ', 8200)
(' Payam    ', 'Kaufling  ', 7900)
(' Shanta   ', 'Vollman   ', 6500)
(' Kevin    ', 'Mourgos   ', 5800)
(' Julia    ', 'Nayer     ', 3200)
(' Irene    ', 'Mikkilinen', 2700)
(' James    ', 'Landry    ', 2400)
(' Steven   ', 'Markle    ', 2200)
(' Laura    ', 'Bissot    ', 3300)
(' Mozhe    ', 'Atkinson  ', 2800)
(' James    ', 'Marlow    ', 2500)
(' TJ       ', 'Olson     ', 2100)
(' Jason    ', 'Mallin    ', 3300)
(' Michael  ', 'Rogers    ', 2900)
(' Ki       ', 'Gee       ', 2400)
(' Hazel    ', 'Philtanker', 2200)
(' Renske   ', 'Ladwig    ', 3600)
(' Stephen  ', 'Stiles    ', 3200)
(' John     ', 'Seo       ', 2700)
(' Joshua   ', 'Patel     ', 2500)
(' Trenna   ', 'Rajs      ', 3500)
(' Curtis   ', 'Davies    ', 3100)
(' Randall  ', 'Matos     ', 2600)
(' Peter    ', 'Vargas    ', 2500)
(' David    ', 'Bernstein ', 9500)
(' Peter    ', 'Hall      ', 9000)
(' Christoph', 'Olsen     ', 8000)
(' Nanette  ', 'Cambrault ', 7500)
(' Oliver   ', 'Tuvault   ', 7000)
(' Patrick  ', 'Sully     ', 9500)
(' Allan    ', 'McEwen    ', 9000)
(' Lindsey  ', 'Smith     ', 8000)
(' Louise   ', 'Doran     ', 7500)
(' Sarath   ', 'Sewall    ', 7000)
(' Danielle ', 'Greene    ', 9500)
(' Mattea   ', 'Marvins   ', 7200)
(' David    ', 'Lee       ', 6800)
(' Sundar   ', 'Ande      ', 6400)
(' Amit     ', 'Banda     ', 6200)
(' Tayler   ', 'Fox       ', 9600)
(' William  ', 'Smith     ', 7400)
(' Elizabeth', 'Bates     ', 7300)
(' Sundita  ', 'Kumar     ', 6100)
(' Alyssa   ', 'Hutton    ', 8800)
(' Jonathon ', 'Taylor    ', 8600)
(' Jack     ', 'Livingston', 8400)
(' Kimberely', 'Grant     ', 7000)
(' harles   ', 'Johnson   ', 6200)
(' Winston  ', 'Taylor    ', 3200)
(' Jean     ', 'Fleaur    ', 3100)
(' Martha   ', 'Sullivan  ', 2500)
(' Girard   ', 'Geoni     ', 2800)
(' Nandita  ', 'Sarchand  ', 4200)
(' Alexis   ', 'Bull      ', 4100)
(' Julia    ', 'Dellinger ', 3400)
(' Anthony  ', 'Cabrio    ', 3000)
(' Kelly    ', 'Chung     ', 3800)
(' Jennifer ', 'Dilly     ', 3600)
(' Timothy  ', 'Gates     ', 2900)
(' Randall  ', 'Perkins   ', 2500)
(' Sarah    ', 'Bell      ', 4000)
(' Britney  ', 'Everett   ', 3900)
(' Samuel   ', 'McCain    ', 3200)
(' Vance    ', 'Jones     ', 2800)
(' Alana    ', 'Walsh     ', 3100)
(' Kevin    ', 'Feeney    ', 3000)
(' Donald   ', 'OConnell  ', 2600)
(' Douglas  ', 'Grant     ', 2600)
(' Jennifer ', 'Whalen    ', 4400)
(' Pat      ', 'Fay       ', 6000)
(' Susan    ', 'Mavris    ', 6500)
(' William  ', 'Gietz     ', 8300)

In [24]:
# 2. Write a query to display the names (first_name, last_name) and department ID of all employees in departments 30 or 100 in 
# ascending alphabetical order by department ID.

In [30]:
sql="select first_name,last_name,department_id from Employee2 where department_id in (30,100) order by department_id asc"
result=cursor.execute(sql)
for row in result:
    print(row)

(' Den      ', 'Raphaely  ', 30)
(' Alexander', 'Khoo      ', 30)
(' Shelli   ', 'Baida     ', 30)
(' Sigal    ', 'Tobias    ', 30)
(' Guy      ', 'Himuro    ', 30)
(' Karen    ', 'Colmenares', 30)
(' Nancy    ', 'Greenberg ', 100)
(' Daniel   ', 'Faviet    ', 100)
(' John     ', 'Chen      ', 100)
(' Ismael   ', 'Sciarra   ', 100)
(' Jose Manu', 'Urman     ', 100)
(' Luis     ', 'Popp      ', 100)

In [31]:
# 3. Write a query to display the names (first_name, last_name) and salary for all employees whose salary is not in
# the range $10,000 through $15,000 and are in department 30 or 100.

In [35]:
sql="select first_name, last_name,salary from Employee2 where salary not between 10000 and 15000 and  department_id in  (30,100) "
result=cursor.execute(sql)
for row in result:
    print(row)

(' Daniel   ', 'Faviet    ', 9000)
(' John     ', 'Chen      ', 8200)
(' Ismael   ', 'Sciarra   ', 7700)
(' Jose Manu', 'Urman     ', 7800)
(' Luis     ', 'Popp      ', 6900)
(' Alexander', 'Khoo      ', 3100)
(' Shelli   ', 'Baida     ', 2900)
(' Sigal    ', 'Tobias    ', 2800)
(' Guy      ', 'Himuro    ', 2600)
(' Karen    ', 'Colmenares', 2500)

In [41]:
#4. Write a query to display the first_name of all employees who have both an "b" and "c" in their first name.

In [42]:
sql="select first_name from Employee2 where first_name like '%b%' and first_name like '%c%'"
result=cursor.execute(sql)
for row in result:
    print(row)

(' Bruce    ',)

In [43]:
# 5. Write a query to display the last name, job, and salary for all employees whose job is that of a Programmer or a Shipping Clerk, and whose salary is not equal to $4,500, $10,000, or $15,000.

In [48]:
sql="select last_name,job_id,salary from Employee2 where job_id in ('IT_PROG   ','SH_CLERK  ')and salary not in (4500,1000,15000)"
result=cursor.execute(sql)
for row in result:
    print(row)

('Hunold    ', 'IT_PROG   ', 9000)
('Ernst     ', 'IT_PROG   ', 6000)
('Austin    ', 'IT_PROG   ', 4800)
('Pataballa ', 'IT_PROG   ', 4800)
('Lorentz   ', 'IT_PROG   ', 4200)
('Taylor    ', 'SH_CLERK  ', 3200)
('Fleaur    ', 'SH_CLERK  ', 3100)
('Sullivan  ', 'SH_CLERK  ', 2500)
('Geoni     ', 'SH_CLERK  ', 2800)
('Sarchand  ', 'SH_CLERK  ', 4200)
('Bull      ', 'SH_CLERK  ', 4100)
('Dellinger ', 'SH_CLERK  ', 3400)
('Cabrio    ', 'SH_CLERK  ', 3000)
('Chung     ', 'SH_CLERK  ', 3800)
('Dilly     ', 'SH_CLERK  ', 3600)
('Gates     ', 'SH_CLERK  ', 2900)
('Perkins   ', 'SH_CLERK  ', 2500)
('Bell      ', 'SH_CLERK  ', 4000)
('Everett   ', 'SH_CLERK  ', 3900)
('McCain    ', 'SH_CLERK  ', 3200)
('Jones     ', 'SH_CLERK  ', 2800)
('Walsh     ', 'SH_CLERK  ', 3100)
('Feeney    ', 'SH_CLERK  ', 3000)
('OConnell  ', 'SH_CLERK  ', 2600)
('Grant     ', 'SH_CLERK  ', 2600)

In [49]:
# 6. Write a query to display the last names of employees whose names have exactly 6 characters.

In [63]:
sql="select last_name from Employee2 where last_name LIKE '______'"

In [64]:
result=cursor.execute(sql)
for row in result:
    print(row)

In [65]:
#7=Write a query to display the last names of employees having 'e' as the third character.

In [68]:
sql="select last_name from Employee2 where last_name like'__e%"
result=cursor.execute(sql)
for row in result:
    print(row)

OperationalError: unrecognized token: "'__e%"

In [69]:
# 8Write a query to display the jobs/designations available in the employees table.

In [70]:
sql="select distinct(job_id) from Employee2"
result=cursor.execute(sql)
for row in result:
    print(row)

('AD_PRES   ',)
('AD_VP     ',)
('IT_PROG   ',)
('FI_MGR    ',)
('FI_ACCOUNT',)
('PU_MAN    ',)
('PU_CLERK  ',)
('ST_MAN    ',)
('ST_CLERK  ',)
('SA_MAN    ',)
('SA_REP    ',)
('SH_CLERK  ',)
('AD_ASST   ',)
('MK_MAN    ',)
('MK_REP    ',)
('HR_REP    ',)
('PR_REP    ',)
('AC_MGR    ',)
('AC_ACCOUNT',)

In [71]:
# 9. Write a query to display the names (first_name, last_name), salary and PF (15% of salary) of all employees

In [74]:
sql="select first_name,last_name,salary from Employee2 where salary*0.15 "

In [75]:
result=cursor.execute(sql)
for row in result:
    print(row)

(' Steven   ', 'King      ', 24000)
(' Neena    ', 'Kochhar   ', 17000)
(' Lex      ', 'De Haan   ', 17000)
(' Alexander', 'Hunold    ', 9000)
(' Bruce    ', 'Ernst     ', 6000)
(' David    ', 'Austin    ', 4800)
(' Valli    ', 'Pataballa ', 4800)
(' Diana    ', 'Lorentz   ', 4200)
(' Nancy    ', 'Greenberg ', 12000)
(' Daniel   ', 'Faviet    ', 9000)
(' John     ', 'Chen      ', 8200)
(' Ismael   ', 'Sciarra   ', 7700)
(' Jose Manu', 'Urman     ', 7800)
(' Luis     ', 'Popp      ', 6900)
(' Den      ', 'Raphaely  ', 11000)
(' Alexander', 'Khoo      ', 3100)
(' Shelli   ', 'Baida     ', 2900)
(' Sigal    ', 'Tobias    ', 2800)
(' Guy      ', 'Himuro    ', 2600)
(' Karen    ', 'Colmenares', 2500)
(' Matthew  ', 'Weiss     ', 8000)
(' Adam     ', 'Fripp     ', 8200)
(' Payam    ', 'Kaufling  ', 7900)
(' Shanta   ', 'Vollman   ', 6500)
(' Kevin    ', 'Mourgos   ', 5800)
(' Julia    ', 'Nayer     ', 3200)
(' Irene    ', 'Mikkilinen', 2700)
(' James    ', 'Landry    ', 2400)
(' Steven   ', 'Markle    ', 2200)
(' Laura    ', 'Bissot    ', 3300)
(' Mozhe    ', 'Atkinson  ', 2800)
(' James    ', 'Marlow    ', 2500)
(' TJ       ', 'Olson     ', 2100)
(' Jason    ', 'Mallin    ', 3300)
(' Michael  ', 'Rogers    ', 2900)
(' Ki       ', 'Gee       ', 2400)
(' Hazel    ', 'Philtanker', 2200)
(' Renske   ', 'Ladwig    ', 3600)
(' Stephen  ', 'Stiles    ', 3200)
(' John     ', 'Seo       ', 2700)
(' Joshua   ', 'Patel     ', 2500)
(' Trenna   ', 'Rajs      ', 3500)
(' Curtis   ', 'Davies    ', 3100)
(' Randall  ', 'Matos     ', 2600)
(' Peter    ', 'Vargas    ', 2500)
(' John     ', 'Russell   ', 14000)
(' Karen    ', 'Partners  ', 13500)
(' Alberto  ', 'Errazuriz ', 12000)
(' Gerald   ', 'Cambrault ', 11000)
(' Eleni    ', 'Zlotkey   ', 10500)
(' Peter    ', 'Tucker    ', 10000)
(' David    ', 'Bernstein ', 9500)
(' Peter    ', 'Hall      ', 9000)
(' Christoph', 'Olsen     ', 8000)
(' Nanette  ', 'Cambrault ', 7500)
(' Oliver   ', 'Tuvault   ', 7000)
(' Janette  ', 'King      ', 10000)
(' Patrick  ', 'Sully     ', 9500)
(' Allan    ', 'McEwen    ', 9000)
(' Lindsey  ', 'Smith     ', 8000)
(' Louise   ', 'Doran     ', 7500)
(' Sarath   ', 'Sewall    ', 7000)
(' Clara    ', 'Vishney   ', 10500)
(' Danielle ', 'Greene    ', 9500)
(' Mattea   ', 'Marvins   ', 7200)
(' David    ', 'Lee       ', 6800)
(' Sundar   ', 'Ande      ', 6400)
(' Amit     ', 'Banda     ', 6200)
(' Lisa     ', 'Ozer      ', 11500)
(' Harrison ', 'Bloom     ', 10000)
(' Tayler   ', 'Fox       ', 9600)
(' William  ', 'Smith     ', 7400)
(' Elizabeth', 'Bates     ', 7300)
(' Sundita  ', 'Kumar     ', 6100)
(' Ellen    ', 'Abel      ', 11000)
(' Alyssa   ', 'Hutton    ', 8800)
(' Jonathon ', 'Taylor    ', 8600)
(' Jack     ', 'Livingston', 8400)
(' Kimberely', 'Grant     ', 7000)
(' harles   ', 'Johnson   ', 6200)
(' Winston  ', 'Taylor    ', 3200)
(' Jean     ', 'Fleaur    ', 3100)
(' Martha   ', 'Sullivan  ', 2500)
(' Girard   ', 'Geoni     ', 2800)
(' Nandita  ', 'Sarchand  ', 4200)
(' Alexis   ', 'Bull      ', 4100)
(' Julia    ', 'Dellinger ', 3400)
(' Anthony  ', 'Cabrio    ', 3000)
(' Kelly    ', 'Chung     ', 3800)
(' Jennifer ', 'Dilly     ', 3600)
(' Timothy  ', 'Gates     ', 2900)
(' Randall  ', 'Perkins   ', 2500)
(' Sarah    ', 'Bell      ', 4000)
(' Britney  ', 'Everett   ', 3900)
(' Samuel   ', 'McCain    ', 3200)
(' Vance    ', 'Jones     ', 2800)
(' Alana    ', 'Walsh     ', 3100)
(' Kevin    ', 'Feeney    ', 3000)
(' Donald   ', 'OConnell  ', 2600)
(' Douglas  ', 'Grant     ', 2600)
(' Jennifer ', 'Whalen    ', 4400)
(' Michael  ', 'Hartstein ', 13000)
(' Pat      ', 'Fay       ', 6000)
(' Susan    ', 'Mavris    ', 6500)
(' Hermann  ', 'Baer      ', 10000)
(' Shelley  ', 'Higgins   ', 12000)
(' William  ', 'Gietz     ', 8300)

In [ ]:
#Student of DataScience
#Srudent of Data Trained -Saurav
#Date-14 July 2022
#Time-20:50